BLOSUM62_TABLE = {'A': {'A': '4', 'R': '-1', 'N': '-2', 'D': '-2', 'C': '0', 'Q': '-1', 'E': '-1', 'G': '0', 'H': '-2', 'I': '-1', 'L': '-1', 'K': '-1', 'M': '-1', 'F': '-2', 'P': '-1', 'S': '1', 'T': '0', 'W': '-3', 'Y': '-2', 'V': '0', 'B': '-2', 'Z': '-1', 'X': '0', '*': '-4'},
                 'R': {'A': '-1', 'R': '5', 'N': '0', 'D': '-2', 'C': '-3', 'Q': '1', 'E': '0', 'G': '-2', 'H': '0', 'I': '-3', 'L': '-2', 'K': '2', 'M': '-1', 'F': '-3', 'P': '-2', 'S': '-1', 'T': '-1', 'W': '-3', 'Y': '-2', 'V': '-3', 'B': '-1', 'Z': '0', 'X': '-1', '*': '-4'},
                 'N': {'A': '-2', 'R': '0', 'N': '6', 'D': '1', 'C': '-3', 'Q': '0', 'E': '0', 'G': '0', 'H': '1', 'I': '-3', 'L': '-3', 'K': '0', 'M': '-2', 'F': '-3', 'P': '-2', 'S': '1', 'T': '0', 'W': '-4', 'Y': '-2', 'V': '-3', 'B': '3', 'Z': '0', 'X': '-1', '*': '-4'},
                 'D': {'A': '-2', 'R': '-2', 'N': '1', 'D': '6', 'C': '-3', 'Q': '0', 'E': '2', 'G': '-1', 'H': '-1', 'I': '-3', 'L': '-4', 'K': '-1', 'M': '-3', 'F': '-3', 'P': '-1', 'S': '0', 'T': '-1', 'W': '-4', 'Y': '-3', 'V': '-3', 'B': '4', 'Z': '1', 'X': '-1', '*': '-4'},
                 'C': {'A': '0', 'R': '-3', 'N': '-3', 'D': '-3', 'C': '9', 'Q': '-3', 'E': '-4', 'G': '-3', 'H': '-3', 'I': '-1', 'L': '-1', 'K': '-3', 'M': '-1', 'F': '-2', 'P': '-3', 'S': '-1', 'T': '-1', 'W': '-2', 'Y': '-2', 'V': '-1', 'B': '-3', 'Z': '-3', 'X': '-2', '*': '-4'},
                 'Q': {'A': '-1', 'R': '1', 'N': '0', 'D': '0', 'C': '-3', 'Q': '5', 'E': '2', 'G': '-2', 'H': '0', 'I': '-3', 'L': '-2', 'K': '1', 'M': '0', 'F': '-3', 'P': '-1', 'S': '0', 'T': '-1', 'W': '-2', 'Y': '-1', 'V': '-2', 'B': '0', 'Z': '3', 'X': '-1', '*': '-4'},
                 'E': {'A': '-1', 'R': '0', 'N': '0', 'D': '2', 'C': '-4', 'Q': '2', 'E': '5', 'G': '-2', 'H': '0', 'I': '-3', 'L': '-3', 'K': '1', 'M': '-2', 'F': '-3', 'P': '-1', 'S': '0', 'T': '-1', 'W': '-3', 'Y': '-2', 'V': '-2', 'B': '1', 'Z': '4', 'X': '-1', '*': '-4'},
                 'G': {'A': '0', 'R': '-2', 'N': '0', 'D': '-1', 'C': '-3', 'Q': '-2', 'E': '-2', 'G': '6', 'H': '-2', 'I': '-4', 'L': '-4', 'K': '-2', 'M': '-3', 'F': '-3', 'P': '-2', 'S': '0', 'T': '-2', 'W': '-2', 'Y': '-3', 'V': '-3', 'B': '-1', 'Z': '-2', 'X': '-1', '*': '-4'},
                 'H': {'A': '-2', 'R': '0', 'N': '1', 'D': '-1', 'C': '-3', 'Q': '0', 'E': '0', 'G': '-2', 'H': '8', 'I': '-3', 'L': '-3', 'K': '-1', 'M': '-2', 'F': '-1', 'P': '-2', 'S': '-1', 'T': '-2', 'W': '-2', 'Y': '2', 'V': '-3', 'B': '0', 'Z': '0', 'X': '-1', '*': '-4'},
                 'I': {'A': '-1', 'R': '-3', 'N': '-3', 'D': '-3', 'C': '-1', 'Q': '-3', 'E': '-3', 'G': '-4', 'H': '-3', 'I': '4', 'L': '2', 'K': '-3', 'M': '1', 'F': '0', 'P': '-3', 'S': '-2', 'T': '-1', 'W': '-3', 'Y': '-1', 'V': '3', 'B': '-3', 'Z': '-3', 'X': '-1', '*': '-4'},
                 'L': {'A': '-1', 'R': '-2', 'N': '-3', 'D': '-4', 'C': '-1', 'Q': '-2', 'E': '-3', 'G': '-4', 'H': '-3', 'I': '2', 'L': '4', 'K': '-2', 'M': '2', 'F': '0', 'P': '-3', 'S': '-2', 'T': '-1', 'W': '-2', 'Y': '-1', 'V': '1', 'B': '-4', 'Z': '-3', 'X': '-1', '*': '-4'},
                 'K': {'A': '-1', 'R': '2', 'N': '0', 'D': '-1', 'C': '-3', 'Q': '1', 'E': '1', 'G': '-2', 'H': '-1', 'I': '-3', 'L': '-2', 'K': '5', 'M': '-1', 'F': '-3', 'P': '-1', 'S': '0', 'T': '-1', 'W': '-3', 'Y': '-2', 'V': '-2', 'B': '0', 'Z': '1', 'X': '-1', '*': '-4'},
                 'M': {'A': '-1', 'R': '-1', 'N': '-2', 'D': '-3', 'C': '-1', 'Q': '0', 'E': '-2', 'G': '-3', 'H': '-2', 'I': '1', 'L': '2', 'K': '-1', 'M': '5', 'F': '0', 'P': '-2', 'S': '-1', 'T': '-1', 'W': '-1', 'Y': '-1', 'V': '1', 'B': '-3', 'Z': '-1', 'X': '-1', '*': '-4'},
                 'F': {'A': '-2', 'R': '-3', 'N': '-3', 'D': '-3', 'C': '-2', 'Q': '-3', 'E': '-3', 'G': '-3', 'H': '-1', 'I': '0', 'L': '0', 'K': '-3', 'M': '0', 'F': '6', 'P': '-4', 'S': '-2', 'T': '-2', 'W': '1', 'Y': '3', 'V': '-1', 'B': '-3', 'Z': '-3', 'X': '-1', '*': '-4'},
                 'P': {'A': '-1', 'R': '-2', 'N': '-2', 'D': '-1', 'C': '-3', 'Q': '-1', 'E': '-1', 'G': '-2', 'H': '-2', 'I': '-3', 'L': '-3', 'K': '-1', 'M': '-2', 'F': '-4', 'P': '7', 'S': '-1', 'T': '-1', 'W': '-4', 'Y': '-3', 'V': '-2', 'B': '-2', 'Z': '-1', 'X': '-2', '*': '-4'},
                 'S': {'A': '1', 'R': '-1', 'N': '1', 'D': '0', 'C': '-1', 'Q': '0', 'E': '0', 'G': '0', 'H': '-1', 'I': '-2', 'L': '-2', 'K': '0', 'M': '-1', 'F': '-2', 'P': '-1', 'S': '4', 'T': '1', 'W': '-3', 'Y': '-2', 'V': '-2', 'B': '0', 'Z': '0', 'X': '0', '*': '-4'},
                 'T': {'A': '0', 'R': '-1', 'N': '0', 'D': '-1', 'C': '-1', 'Q': '-1', 'E': '-1', 'G': '-2', 'H': '-2', 'I': '-1', 'L': '-1', 'K': '-1', 'M': '-1', 'F': '-2', 'P': '-1', 'S': '1', 'T': '5', 'W': '-2', 'Y': '-2', 'V': '0', 'B': '-1', 'Z': '-1', 'X': '0', '*': '-4'},
                 'W': {'A': '-3', 'R': '-3', 'N': '-4', 'D': '-4', 'C': '-2', 'Q': '-2', 'E': '-3', 'G': '-2', 'H': '-2', 'I': '-3', 'L': '-2', 'K': '-3', 'M': '-1', 'F': '1', 'P': '-4', 'S': '-3', 'T': '-2', 'W': '11', 'Y': '2', 'V': '-3', 'B': '-4', 'Z': '-3', 'X': '-2', '*': '-4'},
                 'Y': {'A': '-2', 'R': '-2', 'N': '-2', 'D': '-3', 'C': '-2', 'Q': '-1', 'E': '-2', 'G': '-3', 'H': '2', 'I': '-1', 'L': '-1', 'K': '-2', 'M': '-1', 'F': '3', 'P': '-3', 'S': '-2', 'T': '-2', 'W': '2', 'Y': '7', 'V': '-1', 'B': '-3', 'Z': '-2', 'X': '-1', '*': '-4'},
                 'V': {'A': '0', 'R': '-3', 'N': '-3', 'D': '-3', 'C': '-1', 'Q': '-2', 'E': '-2', 'G': '-3', 'H': '-3', 'I': '3', 'L': '1', 'K': '-2', 'M': '1', 'F': '-1', 'P': '-2', 'S': '-2', 'T': '0', 'W': '-3', 'Y': '-1', 'V': '4', 'B': '-3', 'Z': '-2', 'X': '-1', '*': '-4'},
                 'B': {'A': '-2', 'R': '-1', 'N': '3', 'D': '4', 'C': '-3', 'Q': '0', 'E': '1', 'G': '-1', 'H': '0', 'I': '-3', 'L': '-4', 'K': '0', 'M': '-3', 'F': '-3', 'P': '-2', 'S': '0', 'T': '-1', 'W': '-4', 'Y': '-3', 'V': '-3', 'B': '4', 'Z': '1', 'X': '-1', '*': '-4'},
                 'Z': {'A': '-1', 'R': '0', 'N': '0', 'D': '1', 'C': '-3', 'Q': '3', 'E': '4', 'G': '-2', 'H': '0', 'I': '-3', 'L': '-3', 'K': '1', 'M': '-1', 'F': '-3', 'P': '-1', 'S': '0', 'T': '-1', 'W': '-3', 'Y': '-2', 'V': '-2', 'B': '1', 'Z': '4', 'X': '-1', '*': '-4'},
                 'X': {'A': '0', 'R': '-1', 'N': '-1', 'D': '-1', 'C': '-2', 'Q': '-1', 'E': '-1', 'G': '-1', 'H': '-1', 'I': '-1', 'L': '-1', 'K': '-1', 'M': '-1', 'F': '-1', 'P': '-2', 'S': '0', 'T': '0', 'W': '-2', 'Y': '-1', 'V': '-1', 'B': '-1', 'Z': '-1', 'X': '-1', '*': '-4'},
                 '*': {'A': '-4', 'R': '-4', 'N': '-4', 'D': '-4', 'C': '-4', 'Q': '-4', 'E': '-4', 'G': '-4', 'H': '-4', 'I': '-4', 'L': '-4', 'K': '-4', 'M': '-4', 'F': '-4', 'P': '-4', 'S': '-4', 'T': '-4', 'W': '-4', 'Y': '-4', 'V': '-4', 'B': '-4', 'Z': '-4', 'X': '-4', '*': '1'}}

NAMES = {
    'WindowTitle': 'Выравнивание генетических последовательностей',

    'align_name_1': 'Глобальное выравнивание',
    'align_name_2': 'Локальное выравнивание',
    'align_type_1': 'По BLOSUM62',
    'align_type_2': 'По стандартной (Тестовой)',

    'tab_name_1': '1 + 1',
    'tab_name_2': '1 + many',

    'infile_sign': 'Другие последовательности',
    's_sign': 'Последовательность 1',
    's1_sign': 'Последовательность 1',
    's2_sign': 'Последовательность 2',

    'count_bt_sign': 'Посчитать',

    'status_default_sign': 'Статус: Расчёт не производился',
    'status_signs': ['Статус: Производится расчёт', 'Статус: Расчёт завершён'],

    'infile_bt_sign': 'Выбрать файл',
    'infile_path_sign': 'Выбран файл: ',
    'infile_bt_menu_sign': 'Open file',
    'write_file_bt_sign': 'Запись в файл',
    'write_file_bt_menu_sign': 'Open file',
    'used_align_sign': 'Использованные параметры:',
    'used_align_default_sign': 'Расчёт не производился',

    'infile_default_path': '/',
    'write_file_default_path': '/',
    'write_file_default_name': 'res',

    'table_headers': ['Последовательность 1', 'Последовательность 2', 'Результат'],

    'error_message_title': 'Ошибка',
}  # Names/Signs of UI objects

STYLE = """       
        QPushButton {
          color: white;
          font-weight: bold;
          text-align: center;
          padding: .3em 0;
          border: 1px solid;
          border-color: #60a3d8 #2970a9 #2970a9 #60a3d8;
          border-radius: 6px;
          background-color: qlineargradient(x1:0, y1:0, x2:0, y2:1,
                                               stop:0 #89bbe2, stop: 0.5 #60a3d8  ,
                                               stop:1 #378bce);
        }
        QPushButton:hover {
            background-color: qlineargradient(x1:0, y1:0, x2:0, y2:1,
                                               stop:0 #9dc7e7, stop: 0.5 #74afdd ,
                                               stop:1 #378bce);
        }
                
        QComboBox {
            border: 1px solid #6fabdc;
            border-radius: 6px;
            background-color: qlineargradient(x1:0, y1:0, x2:0, y2:1,
                                               stop:0 #84b7e1, stop: 0.3 #adcfeb,
                                               stop: 0.7 #d6e7f5, stop:1 #98c3e6);
            }
        QComboBox:drop-down {
            border-top-right-radius: 6px; 
            border-bottom-right-radius: 6px;
            }
        QComboBox:down-arrow {
             image: url(../sys/down_arrow.png);
             width: 40px;
            }
        QComboBox:down-arrow:on {
             image: url(../sys/up_arrow.png);
             width: 40px;
            }
            
        QTabWidget::pane { /* Рамка виджета со вкладками */
             border: 1px solid #C2C7CB;
            }
        
        QTabWidget::tab-bar {
             
            }
        QTabBar::tab {
             background: qlineargradient(x1: 0, y1: 0, x2: 0, y2: 1,
                                         stop: 0 #E1E1E1, stop: 0.4 #DDDDDD,
                                         stop: 0.5 #D8D8D8, stop: 1.0 #D3D3D3);
             border: 1px solid #C4C4C3;
             border-bottom-color: #C2C7CB; /* такой же цвет как у панели */
             border-top-left-radius: 4px;
             border-top-right-radius: 4px;
             padding: 5px 20px 5px 20px;
            }
        
         QTabBar::tab:selected, QTabBar::tab:hover {
             background: qlineargradient(x1: 0, y1: 0, x2: 0, y2: 1,
                                         stop: 0 #fafafa, stop: 0.4 #f4f4f4,
                                         stop: 0.5 #e7e7e7, stop: 1.0 #fafafa);
             }
        QTabBar::tab:selected {
             border-color: #9B9B9B;
             border-bottom-color: #C2C7CB; /* такой же цвет как у панели */
             }
        
        QTabBar::tab:!selected {
             margin-top: 3px; /* делаем невыбранные вкладки меньше */
            }

                     
        QHeaderView:section {
             background-color: qlineargradient(x1:0, y1:0, x2:0, y2:1,
                                               stop:0 #84b7e1, stop: 0.3 #adcfeb,
                                               stop: 0.7 #d6e7f5, stop:1 #98c3e6);
             color: #143652;
             padding-left: 4px;
             border: 1px solid #5b9fd7;
            }
        """
